In [1]:
import pandas as pd
import numpy as np

In [10]:
names = ["sandesh", "cow", "fish", "goat"]
df = pd.DataFrame(names, columns=['names'])
df

     names
0  sandesh
1      cow
2     fish
3     goat

In [6]:
#it can be written as
df1= pd.DataFrame({"x": ["sandesh", "cow", "fish", "goat"]}) #older approach only used for 1d arrays
df1

         x
0  sandesh
1      cow
2     fish
3     goat

In [7]:
from sklearn.preprocessing import LabelEncoder
l_en = LabelEncoder()

In [12]:
df["encoded_number"] = l_en.fit_transform(df["names"])
df

     names  encoded_number
0  sandesh               3
1      cow               0
2     fish               1
3     goat               2

In [2]:
dataset = pd.read_csv(r"D:\Github\Data-Science-And-Machine-Learning-Course\Datasets\Loan.csv")

In [18]:
dataset.head(10)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
5,LP001011,Male,Yes,2,Graduate,Yes,5417,4196.0,267.0,360.0,1.0,Urban,Y
6,LP001013,Male,Yes,0,Not Graduate,No,2333,1516.0,95.0,360.0,1.0,Urban,Y
7,LP001014,Male,Yes,3+,Graduate,No,3036,2504.0,158.0,360.0,0.0,Semiurban,N
8,LP001018,Male,Yes,2,Graduate,No,4006,1526.0,168.0,360.0,1.0,Urban,Y
9,LP001020,Male,Yes,1,Graduate,No,12841,10968.0,349.0,360.0,1.0,Semiurban,N

In [30]:
data_property = pd.DataFrame(dataset["Property_Area"], columns=["Property_Area"])
data_property

    Property_Area
0           Urban
1           Rural
2           Urban
3           Urban
4           Urban
..            ...
609         Rural
610         Rural
611         Urban
612         Urban
613     Semiurban

[614 rows x 1 columns]

In [22]:
array_property = l_en.fit_transform(dataset["Property_Area"])

In [32]:
df_of_Property = pd.DataFrame(array_property, columns=["Property Categorization"])
df_of_Property

     Property Categorization
0                          2
1                          0
2                          2
3                          2
4                          2
..                       ...
609                        0
610                        0
611                        2
612                        2
613                        1

[614 rows x 1 columns]